       IDENTIFICATION                DIVISION.
       PROGRAM-ID. OLACOBOL.
      * este e um programa simples q exibe "OLA COBOL" 
      * COMENTARIO cobc -x OLACOBOL.COB compilador do cobol 
       PROCEDURE                     DIVISION.
           DISPLAY "OLA COBOL".  
           STOP RUN.
      * caso eu erre uma codificacao em alguma linha
      * programa ira acusar o erro na linha de baixo.  
